#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

        id                                         = "e2ad0f2c-0b2c-44df-845f-401529ce514f"
        name                                       = "HCIMWEB HSIT"
      ~ use_refresh_tokens                         = false -> true
        # (25 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HCIMWEB_HUAT.module.payara-client.keycloak_openid_client.CLIENT has changed
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "a11031dc-4c8a-480d-832a-ecdccf660a61"
        name                                       = "HCIMWEB HUAT"
      ~ use_refresh_tokens                         = false -> true
        # (25 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.GENESYS-TRAINING.keycloak_generic_client_protocol_mapper.saml_hardcoded_attribute_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "saml_hardcoded_attribute_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "attribute.name"       = "OrganizationName"
          + "attribute.nameformat" = "Basic"
          + "attribute.value"      = "hlbc-train"
          + "friendly.name"        = "OrganizationName"
        }
      + id              = (known after apply)
      + name            = "OrganizationName"
      + protocol        = "saml"
      + protocol_mapper = "saml-hardcode-attribute-mapper"
      + realm_id        = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.GENESYS-TRAINING.keycloak_saml_client.CLIENT will be created
  + resource "keycloak_saml_client" "CLIENT" {
      + assertion_consumer_post_url         = "https://login.cac1.pure.cloud/saml"
      + assertion_consumer_redirect_url     = "https://login.cac1.pure.cloud/saml"
      + base_url                            = "https://apps.cac1.pure.cloud/"
      + canonicalization_method             = "EXCLUSIVE"
      + client_id                           = "GENESYS-TRAINING"
      + client_signature_required           = false
      + description                         = "Contact Center as a Service (CCaaS) Genesys CX Cloud contact center solution. Training environment."
      + enabled                             = true
      + encrypt_assertions                  = false
      + encryption_certificate              = (known after apply)
      + encryption_certificate_sha1         = (known after apply)
      + force_name_id_format                = false
      + force_post_binding                  = true
      + front_channel_logout                = true
      + full_scope_allowed                  = false
      + id                                  = (known after apply)
      + include_authn_statement             = true
      + logout_service_post_binding_url     = "https://login.cac1.pure.cloud/saml/logout"
      + logout_service_redirect_binding_url = "https://login.cac1.pure.cloud/saml/logout"
      + name                                = "GENESYS TRAINING"
      + name_id_format                      = "persistent"
      + realm_id                            = "moh_applications"
      + sign_assertions                     = false
      + sign_documents                      = true
      + signature_algorithm                 = "RSA_SHA256"
      + signature_key_name                  = "NONE"
      + signing_certificate                 = (known after apply)
      + signing_certificate_sha1            = (known after apply)
      + signing_private_key                 = (known after apply)
      + signing_private_key_sha1            = (known after apply)
      + valid_redirect_uris                 = [
          + "https://apps.cac1.pure.cloud/*",
          + "https://login.cac1.pure.cloud/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.GENESYS-TRAINING.keycloak_saml_user_attribute_protocol_mapper.saml_user_attribute_mapper will be created
  + resource "keycloak_saml_user_attribute_protocol_mapper" "saml_user_attribute_mapper" {
      + client_id                  = (known after apply)
      + friendly_name              = "email"
      + id                         = (known after apply)
      + name                       = "email"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "email"
      + saml_attribute_name_format = "Basic"
      + user_attribute             = "email"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*